# Built In Failures View Position Failures Class

Source: https://www.revitapidocs.com/2026/fde09328-faae-0d10-ce24-8f57ada1183a.htm

---

| Built In Failures View Position Failures Class |
| --- |

Failures about Viewport Positions. Inheritance Hierarchy System Object
Autodesk.Revit.DB BuiltInFailures ViewPositionFailures

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static class ViewPositionFailures
```

```
Public NotInheritable Class ViewPositionFailures
```

```
public ref class ViewPositionFailures abstract sealed
```

```
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ViewPositionFailures = class end
```
The BuiltInFailures ViewPositionFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CantMoveViewport | Can't move Viewport when its placement is controlled by the assigned View Position. |
|  | CropRequiredAlignment | Can't move Viewport when its placement is controlled by the assigned View Position. |
|  | ViewAnchorDoesNotSupportView | The View Anchor ""%1!s!"" is not supported by view ""%2!s!"". |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace